"use strict";

var MESSAGE_ARRAY = [
    "Всё отлично!",
    "В целом всё неплохо. Но не всё.",
    "Когда вы делаете фотографию, хорошо бы убирать палец из кадра. В конце концов это просто непрофессионально.",
    "Моя бабушка случайно чихнула с фотоаппаратом в руках и у неё получилась фотография лучше.",
    "Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота и у меня получилась фотография лучше.",
    "Лица у людей на фотке перекошены, как будто их избивают. Как можно было поймать такой неудачный момент?!",
];

var NAMES_ARRAY = [
    "Абайты Бордюр",
    "Абиев Ленин",
    "Абиев Линкор",
    "Багаев Гамлет",
    "Багаев Маяк",
    "Багаев Танк",
    "Баграев Партизан",
    "Базиев Дигорук",
    "Бекоев Француз",
    "Бекузаров Кимерсен",
    "Бекуров Сталин",
    "Бериева Зималетта",
    "Бероева Шоколад",
    "Бесаева Аргентина",
    "Бестаев Гарик",
    "Билаонова Рио-Рита",
    "Билаонов Чатуранга",
    "Бирагов Вайнер",
    "Болиев Хусейн",
    "Боциев Барон",
    "Боцоев Роланд",
    "Булацева Пиффа",
    "Бязров Кромвель",
    "Валиев Дяноз",
    "Габараев Ясон",
    "Габеев Аладдин",
    "Гагиев Пушкин",
    "Гаглоева Мимоза",
    "Гадзаов Талисман",
    "Газаев Цезарь",
    "Гобозов Роланд",
    "Гогниев Спартак",
    "Гочикаев Пушкин",
    "Гудиев Великан",
    "Гусов Ленгиор",
    "Дедегкаев Памир",
    "Джагаев Северян",
    "Джанаев Север",
    "Джанаев Слава",
    "Джимиев Шекспир",
    "Джиоев Джета",
    "Джиоев Зюдвиг",
    "Джиоев Рамзес",
    "Дзаттиаты Анисим",
    "Дзоблаев Шмидт",
    "Кабисов Герой",
    "Кадзаев Тельман",
    "Каллагов Орлов",
    "Калухова Кулина",
    "Келехсаева Барышня",
    "Кибизов Фердинанд",
    "Козаев Кифар",
    "Козаев Комета",
    "Козаев Сувор",
    "Козаев Ушанг",
    "Кудзиева Красавица",
    "Кудухов Ленин",
    "Кудухов Чугун",
    "Кудухов Юпитер",
    "Кулаева Литосфера",
    "Кулов Мустангер",
    "Кулумбегов Борман",
    "Кулумбеков Гранит",
    "Купеев Феномен",
    "Магкаев Доги",
    "Макиев Виконт",
    "Макоев Печенье",
    "Мамаев Марсель",
    "Мамитов Звезда",
    "Мамитов Капитан",
    "Маргиев Геббельс",
    "Маргиев Капот",
    "Маргиев Роджерс",
    "Марзаев Стахан",
    "Меликов Рафаэль",
    "Музаева Маслина",
    "Музиев Таран",
    "Надгериев Рамадан",
    "Ортабаев Уарки",
    "Пересаева Конфета",
    "Персаты Шпала",
    "Плиев Листанбер",
    "Плиев Пушкин",
    "Плиев Тарзан",
    "Пухаев Сари",
    "Саламов Ричард",
    "Сиукаев Афанас",
    "Татров Вилюш",
    "Теблоева Марго",
    "Тедеев Граф",
    "Тедеев Карлик",
    "Тедеев Климент",
    "Тедеев Лозунг",
    "Тедеев Онегин",
    "Тедеев Рузвельт",
    "Тибилов Апполон",
    "Тибилов Рудольф",
    "Тигиев Барон",
    "Тигиев Рабинзон",
    "Туаев Мел",
    "Туаев Тарзан",
    "Туаева Зорька",
    "Тулаев Потомок",
    "Фидаров Японец",
    "Хадзиев Комбайн",
    "Хамикоев Арамис",
    "Хамицаев Наполеон",
    "Хамикоев Чапай",
    "Хасиев Вильгельм",
    "Хестанова Победа",
    "Хубаев Метро",
    "Хубулов Майор",
    "Хубулова Граната",
    "Хугаев Мвагрез",
    "Цаллагова Фиалка",
    "Цогоев Тегеран",
    "Цогоева Антенна",
    "Цогоева Планета",
    "Цховребов Цицерон",
    "Челохсаев Капрал",
    "Четоев Сталин",
    "Чибиров Людвиг",
    "Чибиров Труба",
    "Чховребов Цезарь",
];

var pictureTemplate = document.querySelector("#picture").content;
var fragment = document.createDocumentFragment();
var picturesBlock = document.querySelector(".pictures");

var renderInteger = function(min, max) {
    return Math.floor(Math.random() * (max - min)) + min;
};

var createComments = function(quantity) {
    var comments = [];
    for (var i = 0; i < quantity; i++) {
        var comment = {
            avatar: "img/avatar-" + renderInteger(1, 7) + ".svg",
            message: MESSAGE_ARRAY[renderInteger(0, MESSAGE_ARRAY.length)],
            name: NAMES_ARRAY[renderInteger(0, NAMES_ARRAY.length)],
        };
        comments.push(comment);
    }
    return comments;
};

var createAvatar = function(quantity) {
    var avatars = [];
    for (var i = 0; i < quantity; i++) {
        var avatarData = {
            url: "photos/" + (i + 1) + ".jpg",
            description: "",
            likes: renderInteger(15, 200),
            comments: createComments(renderInteger(1, 7)),
        };
        avatars.push(avatarData);
    }
    return avatars;
};

var createPictures = function(picture) {
    var pictureElement = pictureTemplate.cloneNode(true);

    pictureElement.querySelector(".picture__img").src = picture.url;
    pictureElement.querySelector(".picture__likes").textContent = picture.likes;
    pictureElement.querySelector(".picture__comments").textContent =
        picture.comments.length;

    return pictureElement;
};

var addElement = function(renderWay, elementType) {
    for (var i = 0; i < elementType.length; i++) {
        fragment.appendChild(renderWay(elementType[i]));
    }
    picturesBlock.appendChild(fragment);
};

var pictures = createAvatar(25);
addElement(createPictures, pictures);
